[{"id":3,"palabra":"React","definicion":"Es una libreria de Javascript diseñada para crear interfaces de usuario. Permite el desarrollo de aplicaciones web, aplicaciones de una sola pagina (SPA) e incluso aplicaciones para móviles."},{"id":4,"palabra":"Javascript","definicion":"Lenguaje de programación utilizado principalmente para crear páginas web dinamicas.\nEs un lenguaje interpretado, por lo que no es necesario compilar los programas para ejecutarlos, se pueden probar directamente en cualquier navegador."},{"id":5,"palabra":"Angular","definicion":"Es un framework de Javascript cuya finalidad es facilitar el desarrollo de aplicaciones web SPA. \nEvita escribir codigo repetitivo y lo mantiene ordenado gracias a su patron MVC asegurando los desarrollos con rapidez, a la vez que posibilita modificaciones y actualizaciones."},{"id":6,"palabra":"SQL","definicion":"Es un lenguaje de computación para trabajar con conjuntos de datos y las relaciones entre ellos."},{"id":7,"palabra":"Java","definicion":"Lenguaje de programación utilizado para codificar aplicaciones web.\nJava es un lenguaje multiplataforma, orientado a objetos y centrado en la red. \nEs un lenguaje de programación rápido, seguro y fiable para codificar desde aplicaciones móviles, software empresarial hasta aplicaciones de macrodatos y tecnologías del lado del servidor."},{"id":8,"palabra":"Framework","definicion":"Consiste en una estructura base utilizada como punto de partida para elaborar un proyecto con objetivos específicos.\nEs una especie de plantilla o esquema conceptual, que simplifica la elaboración de una tarea, ya que solo es necesario complementarlo de acuerdo a lo que se quiere realizar."},{"id":9,"palabra":"Git","definicion":"Git es un sistema de control de versiones.\nA diferencia de antiguos sistemas de control de versiones, en Git cada desarrollador tiene un historial completo de su repositorio de código de manera local.\nGit incluye funcionalidades de crear ramas (branch), fusiones y  reescribir historiales de repositorios."},{"id":10,"palabra":"Repositorio Git","definicion":"Es un almacenamiento virtual de tu proyecto. Te permite guardar versiones del código a las que puedes acceder cuando lo necesites."},{"id":11,"palabra":"PHP","definicion":"Es un lenguaje de programación de uso general que se adapta especialmente al desarrollo web.\nEsta enfocado principalmente a la programación de scripts del lado del servidor.\nEl código PHP suele ser procesado en un servidor web por un interprete PHP implementado como un modulo, un Daemon o como un ejecutable de interfaz de entrada común (CGI)."},{"id":12,"palabra":"Data Mining","definicion":"La minería de datos es un campo de la estadística y las ciencias de la computación referido al proceso que intenta descubrir patrones en grandes volúmenes de conjuntos de datos.\nUtiliza los métodos de la inteligencia artificial, aprendizaje automático, estadística y sistema de bases de datos."},{"id":13,"palabra":"PL\/SQL","definicion":"Es un lenguaje de programación incrustado en Oracle. Soporta todas las consultas ya que utiliza la misma manipulación de datos que en SQL, incluyendo nuevas características como: manejo de variables, estructuras modulares, estructuras de control de flujo y toma de decisiones."},{"id":14,"palabra":"Maven","definicion":"Es una herramienta utilizada para la gestión, construcción y compilación de proyectos usualmente programados en Java."},{"id":15,"palabra":"Node.js","definicion":"Es un entorno de tiempo de ejecución de JavaScript. Este entorno de tiempo de ejecución en tiempo real incluye todo lo que se necesita para ejecutar un programa escrito en Javascript."}]